In [3]:
import numpy as np
import pandas as pd

cities = pd.read_csv("../data/cities.csv")
cities

,id,name,coords,start_year,url_name,country,country_state
0,5,Aberdeen,POINT(-2.15 57.15),2017.0,aberdeen,Scotland,NaN
1,6,Adelaide,POINT(138.6 -34.91666667),2017.0,adelaide,Australia,NaN
2,7,Algiers,POINT(3 36.83333333),2017.0,algiers,Algeria,NaN
3,9,Ankara,POINT(32.91666667 39.91666667),2017.0,ankara,Turkey,NaN
4,16,Belém,POINT(-48.48333333 -1.466666667),2017.0,belem,Brazil,NaN
...,...,...,...,...,...,...,...
329,265,Nantes,POINT(-1.553889 47.217222),1877.0,nantes,France,NaN
330,110,Stockholm,POINT(18.05 59.28333333),1919.0,stockholm,Sweden,NaN
331,266,Rennes,POINT(-1.680833 48.114167),1897.0,rennes,France,NaN
332,15,Beijing,POINT(116.4166667 39.91666667),1965.0,beijing,China,NaN
333,69,London,POINT(-0.08333333333 51.53333333),1833.0,london,England,NaN

In [4]:
lines = pd.read_csv("../data/lines.csv")
lines

,id,city_id,name,url_name,color,system_id,transport_mode_id
0,43,4,Línea 2,43-linea-2,#ffbe2e,267,4.0
1,75,34,Línea 3 Metro de Caracas,75-linea-3-metro-de-caracas,#000,119,NaN
2,107,126,Línea 1,107-linea-1,#434343,249,NaN
3,604,74,La navette,604-la-navette,#009ab9,346,NaN
4,61,66,Línea 1 (Tramo 1A),61-linea-1,#49aa43,250,NaN
...,...,...,...,...,...,...,...
1338,1466,124,Ramaditas,1466-ramaditas,#4a90e2,493,7.0
1339,1467,124,Polanco,1467-polanco,#4a90e2,493,7.0
1340,1468,124,Delicias,1468-delicias,#4a90e2,493,7.0
1341,1469,124,Perdices,1469-perdices,#4a90e2,493,7.0
1342,1470,124,Las Cañas,1470-las-canas,#4a90e2,493,7.0

In [5]:
station_lines = pd.read_csv('../data/station_lines.csv')
station_lines

,id,station_id,line_id,city_id,created_at,updated_at
0,47,7754,570,74,2017-11-21 00:00:00,2017-11-21 00:00:00
1,48,7771,571,74,2017-11-21 00:00:00,2017-11-21 00:00:00
2,49,7764,571,74,2017-11-21 00:00:00,2017-11-21 00:00:00
3,50,7763,571,74,2017-11-21 00:00:00,2017-11-21 00:00:00
4,51,7729,571,74,2017-11-21 00:00:00,2017-11-21 00:00:00
...,...,...,...,...,...,...
16237,16790,16554,1454,91,2019-03-11 21:35:50.069711,2019-03-11 21:35:50.069711
16238,16791,16555,1454,91,2019-03-11 21:36:13.073166,2019-03-11 21:36:13.073166
16239,16792,16556,1454,91,2019-03-11 21:40:42.812162,2019-03-11 21:40:42.812162
16240,16793,16557,1454,91,2019-03-11 21:42:15.280984,2019-03-11 21:42:15.280984
16241,16794,16558,1454,91,2019-03-11 21:42:48.700022,2019-03-11 21:42:48.700022

In [6]:
stations = pd.read_csv('../data/stations.csv')
stations

,id,name,geometry,buildstart,opening,closure,city_id
0,7694,Keisei Tsudanuma,POINT(140.024812197129 35.6837744784723),1921.0,1921.0,999999.0,114
1,6003,Kossuth Lajos tér,POINT(19.0462376564033 47.5054880717671),0.0,0.0,999999.0,29
2,7732,Saint-Charles,POINT(5.3801556 43.3024646),1973.0,1977.0,999999.0,74
3,7695,Keisei Makuhari-Hongo,POINT(140.042146725175 35.6726021159981),1991.0,1991.0,999999.0,114
4,7726,Chartreux,POINT(5.4014815 43.309129),1973.0,1977.0,999999.0,74
...,...,...,...,...,...,...,...
15789,16554,Shinomiya,POINT(135.823937214498 34.9918683039252),1912.0,1912.0,999999.0,91
15790,16555,Keihan Yamashina,POINT(135.816689306704 34.992068923936),1912.0,1912.0,999999.0,91
15791,16556,Hino-oka,POINT(135.799931852138 34.9968986641574),1912.0,1912.0,1997.0,91
15792,16557,Kujoyama,POINT(135.792375683554 35.0018274164674),1936.0,1936.0,1997.0,91
15793,16558,Keage,POINT(135.789089795388 35.0092276439636),1912.0,1912.0,1997.0,91

In [7]:
systems = pd.read_csv('../data/stations.csv')
stations

,id,name,geometry,buildstart,opening,closure,city_id
0,7694,Keisei Tsudanuma,POINT(140.024812197129 35.6837744784723),1921.0,1921.0,999999.0,114
1,6003,Kossuth Lajos tér,POINT(19.0462376564033 47.5054880717671),0.0,0.0,999999.0,29
2,7732,Saint-Charles,POINT(5.3801556 43.3024646),1973.0,1977.0,999999.0,74
3,7695,Keisei Makuhari-Hongo,POINT(140.042146725175 35.6726021159981),1991.0,1991.0,999999.0,114
4,7726,Chartreux,POINT(5.4014815 43.309129),1973.0,1977.0,999999.0,74
...,...,...,...,...,...,...,...
15789,16554,Shinomiya,POINT(135.823937214498 34.9918683039252),1912.0,1912.0,999999.0,91
15790,16555,Keihan Yamashina,POINT(135.816689306704 34.992068923936),1912.0,1912.0,999999.0,91
15791,16556,Hino-oka,POINT(135.799931852138 34.9968986641574),1912.0,1912.0,1997.0,91
15792,16557,Kujoyama,POINT(135.792375683554 35.0018274164674),1936.0,1936.0,1997.0,91
15793,16558,Keage,POINT(135.789089795388 35.0092276439636),1912.0,1912.0,1997.0,91

In [8]:
track_lines = pd.read_csv('../data/track_lines.csv')
track_lines

,id,section_id,line_id,created_at,updated_at,city_id
0,2494,1278,343,2017-11-21 00:00:00,2017-11-21 00:00:00,252
1,4124,4477,779,2017-11-21 00:09:55.135507,2017-11-21 00:09:55.135507,63
2,2495,21,9,2017-11-21 00:00:00,2017-11-21 00:00:00,1
3,2496,940,228,2017-11-21 00:00:00,2017-11-21 00:00:00,79
4,4129,4478,793,2017-11-21 17:44:39.765832,2017-11-21 17:44:39.765832,48
...,...,...,...,...,...,...
9752,10699,10530,1611,2019-03-06 22:23:46.008756,2019-03-06 22:23:46.008756,91
9753,10700,10531,1611,2019-03-06 22:27:46.532431,2019-03-06 22:27:46.532431,91
9754,10701,10532,1611,2019-03-06 22:30:58.779519,2019-03-06 22:30:58.779519,91
9755,10702,10533,1610,2019-03-08 21:57:21.68915,2019-03-08 21:57:21.68915,91
9756,10703,10534,1614,2019-03-08 22:04:02.309454,2019-03-08 22:04:02.309454,91

In [9]:
tracks = pd.read_csv('../data/tracks.csv')
tracks

,id,geometry,buildstart,opening,closure,length,city_id
0,1911,"LINESTRING(19.0817752 47.5005079,19.0817355 47...",0.0,0.0,999999.0,6719,29
1,2563,"LINESTRING(16.4151057 48.1907238,16.4156455 48...",0.0,0.0,999999.0,199,118
2,2557,"LINESTRING(16.4164437 48.1839655,16.4161534 48...",0.0,0.0,999999.0,925,118
3,2558,"LINESTRING(16.4164901 48.1839473,16.416198 48....",0.0,0.0,999999.0,881,118
4,2564,"LINESTRING(16.415259 48.1908074,16.4153634 48....",0.0,0.0,999999.0,213,118
...,...,...,...,...,...,...,...
9266,9732,"LINESTRING(-3.838067 56.0044551,-3.8385588 56....",0.0,0.0,999999.0,383,48
9267,9734,"LINESTRING(-3.8549229 55.9960854,-3.8544735 55...",0.0,0.0,999999.0,28,48
9268,9735,"LINESTRING(-3.8597111 55.9955538,-3.8572319 55...",0.0,0.0,999999.0,305,48
9269,9736,"LINESTRING(-3.8544735 55.9961285,-3.8529015 55...",0.0,0.0,999999.0,828,48
9270,9733,"LINESTRING(-3.8599176 55.9955291,-3.8597111 55...",0.0,0.0,999999.0,13,48